apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_aes.c
      ret = esp32s3_aes_setkey(&aes, key, keybits);
      DEBUGASSERT(ret == 0);

      memcpy(iv_buf, iv, 16);
      ret = esp32s3_aes_cbc_cypher(&aes, 1, iv_buf, input,
                                   encrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(encrypt_buf, result[i], size))
        {
          DEBUGASSERT(0);
        }

      memcpy(iv_buf, iv, 16);
      ret = esp32s3_aes_cbc_cypher(&aes, 0, iv_buf, encrypt_buf,
                                   decrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(decrypt_buf, input, size))
        {
          DEBUGASSERT(0);
        }

      syslog(LOG_INFO, "AES CBC key=%d bits test: PASS\n", keybits);
    }
}

/****************************************************************************
 * Name: esp32s3_aes_ctr_test
 *
 * Description:
 *   ESP32-S3 AES-CTR test.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32s3_aes_ctr_test(void)
{
  int ret;
  int i;
  int keybits;
  uint8_t encrypt_buf[32];
  uint8_t decrypt_buf[32];
  uint8_t cnt_buf[16];
  uint8_t cache_buf[16];
  uint32_t nc_off;
  struct esp32s3_aes_s aes;
  const int size = 32;

  const uint32_t input[8] =
    {
      0x740fdb34, 0x002defca, 0xb042437b, 0xc2f42cf9,
      0xc64444be, 0x32365bc1, 0xb613cfa2, 0x15ce0d23
    };

  const uint32_t key[16] =
    {
      0x8ffdc2c5, 0x14d6c69d, 0x9cb7608f, 0x899b2472,
      0xbf9e4372, 0x855290d0, 0xc62753da, 0xdeedeab7
    };

  const uint32_t cnt[4] =
    {
      0xf53a50f2, 0x8aaf711d, 0x953bbbfa, 0x228d53cb
    };

  const uint32_t result[2][8] =
    {
      /* keybits = 128 */

      {
        0x5f922338, 0x5aff403d, 0x45fede3f, 0x616568c6,
        0x3cd0ffc7, 0xa26cb704, 0x0aaa8b6a, 0x1d0b5e1c
      },

      /* keybits = 256 */

      {
        0x70af4473, 0x597d2126, 0xd598ed09, 0x3fea540c,
        0xfb5c743c, 0x0c1a39ca, 0xcbcf2d17, 0x341a7a0c
      }
    };

  for (i = 0; i < 2; i++)
    {
      keybits = i * 128 + 128;

      ret = esp32s3_aes_setkey(&aes, key, keybits);
      DEBUGASSERT(ret == 0);

      nc_off = 0;
      memcpy(cnt_buf, cnt, 16);
      ret = esp32s3_aes_ctr_cypher(&aes, &nc_off, cnt_buf, cache_buf,
                                   input, encrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(encrypt_buf, result[i], size))
        {
          DEBUGASSERT(0);
        }

      nc_off = 0;
      memcpy(cnt_buf, cnt, 16);
      ret = esp32s3_aes_ctr_cypher(&aes, &nc_off, cnt_buf, cache_buf,
                                   encrypt_buf, decrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(decrypt_buf, input, size))
        {
          DEBUGASSERT(0);
        }

      syslog(LOG_INFO, "AES CTR key=%d bits test: PASS\n", keybits);
    }
}

/****************************************************************************
 * Name: esp32s3_aes_xts_test
 *
 * Description:
 *   ESP32-S3 AES-XTS test.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32s3_aes_xts_test(void)
{
  int ret;
  int i;
  int keybits;
  uint8_t encrypt_buf[32];
  uint8_t decrypt_buf[32];
  uint8_t unit_buf[16];
  struct esp32s3_aes_xts_s aes;
  int size;

  const uint32_t input[8] =
    {
      0x740fdb34, 0x002defca, 0xb042437b, 0xc2f42cf9,
      0xc64444be, 0x32365bc1, 0xb613cfa2, 0x15ce0d23
    };

  const uint32_t key[16] =
    {
      0x8ffdc2c5, 0x14d6c69d, 0x9cb7608f, 0x899b2472,
      0xbf9e4372, 0x855290d0, 0xc62753da, 0xdeedeab7,
      0x7ac6c53b, 0xc94f0b81, 0xdd673fc9, 0x8c1b71a6,
      0x1f99b728, 0x5e7af2eb, 0xcc7274a3, 0xf0005b23
    };

  const uint32_t unit[4] =
    {
      0xf53a50f2, 0x8aaf711d, 0x953bbbfa, 0x228d53cb
    };

  const uint32_t result_in32[2][8] =
    {
      /* keybits = 256 */

      {
        0xf70e05fd, 0x2791be41, 0x926ec006, 0xc76068f4,
        0x01fd0843, 0xdf5e576a, 0xa4b1833d, 0x90502608
      },

      /* keybits = 512 */

      {
        0x164b4185, 0x4cb1cce7, 0xf285e523, 0x06a5923a,
        0xae4fcb7b, 0x59ce9dc6, 0xed64546f, 0x5889cb17
      }
    };

  const uint32_t result_in30[2][8] =
    {
      /* keybits = 256 */

      {
        0x26991fb6, 0x72e4a7bc, 0x97041d61, 0x9ec889af,
        0xf70e05fd, 0x2791be41, 0x926ec006, 0x000068f4
      },

      /* keybits = 512 */

      {
        0x4b42dd86, 0xeee792c0, 0x1516ff95, 0x1f5fd9e6,
        0x164b4185, 0x4cb1cce7, 0xf285e523, 0x0000923a
      }
    };

  for (i = 0; i < 2; i++)
    {
      keybits = i * 256 + 256;

      ret = esp32s3_aes_xts_setkey(&aes, key, keybits);
      DEBUGASSERT(ret == 0);

      /* Encrypt/Decrypt 32 bytes */

      size = 32;

      memcpy(unit_buf, unit, 16);
      ret = esp32s3_aes_xts_cypher(&aes, true, unit_buf, input,
                                   encrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(encrypt_buf, result_in32[i], size))
        {
          DEBUGASSERT(0);
        }

      memcpy(unit_buf, unit, 16);
      ret = esp32s3_aes_xts_cypher(&aes, false, unit_buf, encrypt_buf,
                                   decrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(decrypt_buf, input, size))
        {
          DEBUGASSERT(0);
        }

      /* Encrypt/Decrypt 30 bytes */

      size = 30;

      memcpy(unit_buf, unit, 16);
      ret = esp32s3_aes_xts_cypher(&aes, true, unit_buf, input,
                                   encrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(encrypt_buf, result_in30[i], size))
        {
          DEBUGASSERT(0);
        }

      memcpy(unit_buf, unit, 16);
      ret = esp32s3_aes_xts_cypher(&aes, false, unit_buf, encrypt_buf,
                                   decrypt_buf, size);
      DEBUGASSERT(ret == 0);

      if (memcmp(decrypt_buf, input, size))
        {
          DEBUGASSERT(0);
        }

      syslog(LOG_INFO, "AES XTS key=%d bits test: PASS\n", keybits);
    }
}

#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_aes_ecb_cypher
 *
 * Description:
 *   Process AES ECB encryption/decryption.
 *
 * Input Parameters:
 *   aes     - AES object data pointer
 *   encrypt - True: encryption mode; False: decryption mode
 *   input   - Input data pointer
 *   output  - Output buffer pointer
 *   size    - Data size in bytes
 *
 * Returned Value:
 *   OK is returned on success. Otherwise, a negated errno value is returned.
 *
 ****************************************************************************/

int esp32s3_aes_ecb_cypher(struct esp32s3_aes_s *aes, bool encrypt,
                           const void *input, void *output, uint32_t size)
{
  int ret;
  uint32_t i;
  const uint8_t *s = (const uint8_t *)input;
  uint8_t *d = (uint8_t *)output;

  DEBUGASSERT(aes && input && output);
  DEBUGASSERT(size && ((size % AES_BLK_SIZE) == 0));

